src/cf/InformationRegisters/СостоянияЗаданийРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЗаданийРаспознаваниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНаСервисеРаспознаваниеДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторИсточникаРаспознавания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияЗаданийРаспознаваниеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьСтатусОбработкиЗадания(ИдентификаторЗадания, Статус, ИдентификаторИсточникаРаспознавания = Неопределено) Экспорт
	
	Запись = РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторЗадания = ИдентификаторЗадания;
	Запись.Прочитать();
	Если Запись.ИдентификаторЗадания = "" Тогда
		Запись.ИдентификаторЗадания = ИдентификаторЗадания;
	КонецЕсли;
	Запись.Статус = Статус;
	Если ЗначениеЗаполнено(ИдентификаторИсточникаРаспознавания) Тогда
		Запись.ИдентификаторИсточникаРаспознавания = ИдентификаторИсточникаРаспознавания;
	КонецЕсли;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
